Autodesk.Revit.DB.Panel.FindHostPanel
Finds the id of the host panel (i.e., wall)
associated with this panel. If a host panel is present, then
it is displayed instead of the curtain panel.
Returns: Element id of the host panel associated with this panel.
Otherwise, InvalidElementId is returned
Since: 2015

Autodesk.Revit.DB.Panel.GetRefGridLines(Autodesk.Revit.DB.ElementId@,Autodesk.Revit.DB.ElementId@)
This method is used to get the reference gridlines.

Autodesk.Revit.DB.Panel.Transform
This property is used to find the transform of a curtain panel within project.
Remarks: The Transform property returns a Autodesk::Revit::DB::Transform object that can be used to find the
transfer matrix of a curtain panel within the project.

Autodesk.Revit.DB.Panel.PanelType
The Panel style of this Panel.
Remarks: The Symbol property can be used to retrieve the kind of the panel.
This property can also be used to change the type of a panel by setting it to a different type.
All the panel types in the project can be found using
the Document.CurtainPanelTypes property.

Autodesk.Revit.DB.Panel.Lockable
This property is used to know whether a panel can be locked.
Remarks: If the panel can be locked, return true, else false.

Autodesk.Revit.DB.Panel
This object represents a curtain panel.